---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RevolvedSurface
source: html/89dbf6bb-4981-21c4-a8cb-e1fdc1cd0fff.htm
---
# RevolvedSurface Members

Creates a Surface object coincident with the surface of revolution defined by a coordinate frame and a profile curve.